{
  "header": {
    "title": "Rodolfo Thiede B: sobre mí",
    "description": "Rodolfo Thiede B: desarrollador creativo en Santiago, Chile."
  },
  "about_me_one": "¡Hola! Mi nombre es Rodolfo, tengo 26 años y vivo en Santiago, Chile. Mi eje profesional se centra en la informática, participando principalmente en áreas tales como desarrollo de software y la administración de infraestructuras en la nube. Usualmente intento utilizar las últimas tecnologías que ofrece el mercado, y mi misión como profesional es ser un aporte constante y otorgar calidad a los proyectos en los que me toca participar. Soy consciente de que en esta profesión todo está mutando día a día, es por eso que me gusta estar en constante aprendizaje.",
  "about_me_two": "Considero que soy una persona a la cual le gustan los nuevos desafíos. Desde pequeño tuve contacto con el mundo de la electrónica, habiendo nacido en la era donde la tecnología estaba en pleno crecimiento. Aprendí a programar a los 16 años por curiosidad y un par de años más tarde decidí estudiar y hacer de esto mi profesión.",
  "about_me_three": "Personalmente, considero que la educación tradicional universitaria no me motiva tanto a diferencia de aprender cosas nuevas de manera autodidacta, y de distintos tópicos (no sólo de informática). Otros temas que me apasionan es dibujar, pintar, las series de ciencia ficción, leer sobre ciencia y tecnología, los idiomas, la gastronomía y la fotografía. También disfruto mucho de la música y sus distintos géneros. No soy una persona muy fan de los deportes, pero hago nado libre en las mañanas durante la semana. Llevo casi cuatro años siendo vegetariano y estoy trabajando para pasar al veganismo pronto. Siento que poco a poco vamos avanzando como humanidad hacia un mundo libre de crueldad animal.",
  "skills": "Habilidades",
  "professional_experience": "Experiencia profesional",
  "programming_languages": "Lenguajes de programación",
  "operative_systems": "Sistemas operativos",
  "web_technologies": "Dominio de tecnologías",
  "databases": "Bases de datos",
  "cloud_infrastructure": "Infraestructura",
  "others": "Otros",
  "tcit_desc": "Trabajando para cliente Walmart Tech, lugar en el que hasta la fecha me encuentro apoyando a distintos equipos con la migración de sus aplicaciones en infraestructura Azure hacia una plataforma nativa privada de la compañía.",
  "dataria_desc": "Durante los primeros meses de la pandemia por Coronavirus trabajé de manera remota como desarrollador de interfaz de usuario de una aplicación que manejaba datos provinientes de tecnologías IoT.",
  "forcast_desc": "Me desempeñé como desarrollador en múltiples proyectos, principalmente en la creación de aplicaciones web que consumían datos de APIs IoT relacionadas al campo de energía solar y empresas salmoneras.",
  "beltes_desc": "Trabajé principalmente en el desarrollo de su plataforma web y sistemas de publicación de anuncios de propiedades inmobiliarias para la región de Coquimbo.",
  "habtium_desc": "Colaboré en el desarrollo y diseño de la décima versión de la página web, también con el desarrollo de herramientas internas y administrativas."
}
