{
  "header": {
    "title": "Rodolfo Thiede B: sobre mí",
    "description": "Rodolfo Thiede B: desarrollador creativo en Santiago, Chile."
  },
  "about_me_one": "¡Hola! Mi nombre es Rodolfo, tengo {{yearsOld}} años y vivo en Santiago, Chile. Desarrollador de software de profesión, con más de cuatro años de experiencia en el área tecnológica. Durante todo este tiempo he trabajado tanto en empresas pequeñas como grandes. Mi interés profesional está centrado en el desarrollo de micro-servicios y un poco de front-end usando tecnologías JavaScript como Node.js. Durante todos estos años, he hecho un poco de todo e intento utilizar las últimas tecnologías que estén a disposición. Personalmente, mi misión como profesional es ser un aporte constante y otorgar calidad a los proyectos en los que me toca participar, siendo consciente de que en esta área, todo está en constante cambio y mejora. Me gusta aprender cosas nuevas y tomar desafíos nuevos, pero siempre buscando la estabilidad y equilibrio.",
  "about_me_two": "Desde pequeño tuve contacto con el mundo de la electrónica, habiendo nacido en una era donde la tecnología estaba en pleno crecimiento y masificación. Aprendí a programar a los 16 años, gracias a un videojuego y habiendo desarrollado tanto back-end como front-end, descubrí que podía convertir esto en mi profesión. Siempre me he caracterizado por ser autodidacta y de distintos tópicos (no sólo de temas informáticos). En mi tiempo libre suelo hacer ejercicio, me gusta cocinar y aprender nuevas recetas, (siempre que haya tiempo jeje…). Ver series de ciencia ficción, leer sobre tecnología y ciencia, los idiomas y la fotografía y viajar, conociendo nuevas culturas de otros países. En cuanto a gustos musicales, suelo escuchar de todo. Mi deporte favorito: la natación.",
  "about_me_three": "Habiéndote comentado un poco sobre mi vida personal, ahora pasaremos a los conocimientos que suelo usar en mi trabajo. Conforme pasa el tiempo voy añadiendo cosas y a veces quito otras, ya que la industria va avanzando y no se puede ser experto en todo, ya que va cambiando y lo que sabes puede que ya no sea tan útil… sin embargo, trato de ser honesto. Más abajo te cuento sobre mis experiencias laborales y que cosas logré realizar durante esos periodos. ¡Gracias por leer!",
  "skills": "Dominio de tecnologías",
  "professional_experience": "Experiencia profesional",
  "programming_languages": "Lenguajes de programación",
  "operative_systems": "Sistemas operativos",
  "web_technologies": "Librerías / Frameworks",
  "databases": "Bases de datos",
  "cloud_infrastructure": "Infraestructura",
  "others": "Otros",
  "cocacola_desc": "Actualmente trabajando en la célula de transformación digital de la división tecnológica de la compañía.",
  "walmart_desc": "Trabajé en la migración de ecosistemas e-commerce desde nube Azure hacia infraestructura privada de la compañía, logrando implementar la ejecución de pruebas automatizadas, actualizaciones de seguridad y observabilidad de Portal VeV y catálogo maestro. Adicionalmente me desempeñé como desarrollador dentro del área de Marketplace, concretamente en la parte de recaudación generando automatización de reporte de ventas diarias, además de implementar a su totalidad la observabilidad y buenas prácticas para Kafka.",
  "sr_desc": "Prestando servicios a Walmart Chile, participando en el desarrollo de microservicios back-end usando Nest.js conectados a Kafka, en los cuales, se registraban las transacciones provenientes de Marketplace de Lider.cl. Se implementó además el sistema completo de observabilidad y monitoreo utilizando Prometheus y Grafana para visualización.",
  "tcit_desc": "Presté servicios a Walmart Chile, dentro de la iniciativa de migración de ecosistemas en Azure hacia Cloud privada de la compañía global. Durante este periodo se lograron migrar dos ecosistemas (plataforma VeV en Node.js, catálogo productos 3P,  con un total de 12 micro-servicios escritos en Golang). Implementación de observabilidad y monitoreo usando Prometheus y Grafana.",
  "dataria_desc": "Durante los primeros meses de la pandemia estuve trabajando de manera remota como desarrollador de una plataforma React.js, que presentaba datos geográficos, fluviometría y pluviometría de ciertas regiones del país recabando información desde servidores IoT. Back-end basado en Node usando Express.js, el cual extraía datos de un ETL.",
  "forcast_desc": "Trabajé como desarrollador de una plataforma web utilizando el framework Angular v8, la cual tenía como objetivo organizar y permitir la visualización de energía y potencia generada por paneles solares. Además estuve involucrado en la creación de una API Node.js usando Sequelize ORM, que recibía datos de un criadero de salmones.",
  "beltes_desc": "Trabajé principalmente en el desarrollo de su plataforma web y sistemas de publicación de anuncios de propiedades inmobiliarias para la región de Coquimbo.",
  "habtium_desc": "Colaboré en el desarrollo y diseño de la décima versión de la página web, también con el desarrollo de herramientas internas y administrativas."
}
